Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: From %@…
fr: De %@...
ko: %@에서…
tr: %@ Kaynağından…
vi: Từ %@…
zh_hans: 从 %@…
zh_hant: 從 %@…

source: Tables, columns, indexes, and foreign keys for the connected database
fr: Tables, colonnes, index et clés étrangères pour la base de données connectée.
ko: 연결된 데이터베이스의 테이블, 열, 인덱스 및 외래 키
tr: Bağlı veritabanının tabloları, sütunları, indeksleri ve yabancı anahtarları
vi: Bảng, cột, index và khóa ngoại của cơ sở dữ liệu đã kết nối
zh_hans: 已连接数据库的表、列、索引和外键
zh_hant: 已連線資料庫的資料表、欄位、索引和外鍵

source: Revoked
fr: Revocé
ko: 철회됨
tr: İptal Edildi
vi: Đã thu hồi
zh_hans: 已撤销
zh_hant: 已撤銷

source: All Types
fr: Tous les types
ko: 모든 유형
tr: Tüm Türler
vi: Tất cả kiểu
zh_hans: 所有类型
zh_hant: 所有類型

source: EXPORT DATABASE writes the whole database. There is no table filter.
fr: L'EXPORT DATABASE écrit toute la base de données. Il n'y a pas de filtre de table.

source: Server output
fr: Sortie du serveur

source: Never Ask
fr: Ne demandez jamais

# Plugin requires app version %@ or later, but current version is %@
source: Plugin requires app version %1$@ or later, but current version is %2$@
fr: Le plugin nécessite la version %1$@ ou ultérieure de l'application, mais la version actuelle est %2$@.
ko: 플러그인에는 앱 버전 %1$@ 이상이 필요하지만 현재 버전은 %2$@입니다
tr: Eklenti %@ veya sonrası bir uygulama sürümü gerektiriyor, mevcut sürüm ise %@
vi: Plugin yêu cầu ứng dụng phiên bản %@ trở lên, nhưng phiên bản hiện tại là %@
zh_hans: 插件需要应用版本 %@ 或更高，但当前版本为 %@
zh_hant: 外掛需要應用程式版本 %1$@ 或更新版本，但目前版本為 %2$@

source: Choose an existing database file
fr: Choisissez un fichier de base de données existant

source: Plugin Update Failed
fr: Mise à jour du plugin échouée
ko: 플러그인 업데이트 실패
tr: Eklenti Güncellemesi Başarısız
vi: Cập nhật plugin thất bại
zh_hans: 插件更新失败
zh_hant: 外掛更新失敗

source: Focus Assistant
fr: Assistant de concentration

source: Built-in CLI
fr: CLI intégrée
ko: 내장 CLI
tr: Yerleşik CLI
vi: CLI tích hợp
zh_hans: 内置 CLI
zh_hant: 內建 CLI

source: Choose a location to save the diagram as PNG.
fr: Choisissez un emplacement pour enregistrer le diagramme en format PNG.
ko: 다이어그램을 PNG로 저장할 위치를 선택하십시오.
tr: Diyagramı PNG olarak kaydetmek için bir konum seçin.
vi: Chọn vị trí để lưu sơ đồ dưới dạng PNG.
zh_hans: 选择位置将图表保存为 PNG。
zh_hant: 選擇位置以將圖表儲存為 PNG。

source: Connection the window shows
fr: Connexion la fenêtre affiche
ko: 창이 표시하는 연결
tr: Pencerenin gösterdiği bağlantı
vi: Kết nối mà cửa sổ đang hiển thị
zh_hans: 该窗口显示的连接
zh_hant: 該視窗顯示的連線

source: View on GitHub
fr: Voir sur GitHub
ko: GitHub에서 보기
tr: GitHub'da Görüntüle
vi: Xem trên GitHub
zh_hans: 在 GitHub 上查看
zh_hant: 在 GitHub 上檢視

source: SQL the session proposes appears here before it runs.
fr: SQL la session proposée apparaît ici avant qu'elle ne soit exécutée.

source: Invalid MongoDB syntax: %@
fr: Syntaxe MongoDB invalide : %@
ko: 잘못된 MongoDB 구문: %@
tr: Geçersiz MongoDB sözdizimi: %@
vi: Cú pháp MongoDB không hợp lệ: %@
zh_hans: 无效的 MongoDB 语法: %@
zh_hant: MongoDB 語法無效：%@

source: %d rows in other coordinate systems are not drawn.
fr: %d lignes dans d'autres systèmes de coordonnées ne sont pas tracées.

source: No Connections
fr: Aucune connexion
ko: 연결 없음
tr: Bağlantı Yok
vi: Chưa có kết nối
zh_hans: 无连接
zh_hant: 無連線

source: Showing the first %1$@ points of %2$@ loaded rows
fr: Affichage des premiers points %1$@ des lignes %2$@ chargées.
ko: 불러온 %2$@행 중 처음 %1$@개 지점을 표시 중
tr: Yüklenen %2$@ satırın ilk %1$@ noktası gösteriliyor
vi: Đang hiển thị %1$@ điểm đầu tiên trong %2$@ hàng đã tải
zh_hans: 显示已加载 %2$@ 行中的前 %1$@ 个点
zh_hant: 顯示已載入 %2$@ 列中的前 %1$@ 個點

source: output_path must not name a hidden file.
fr: output_path ne doit pas nommer un fichier caché.
ko: output_path는 숨김 파일을 가리킬 수 없습니다.
tr: output_path gizli bir dosyayı belirtmemelidir.
vi: output_path không được trỏ tới một tệp ẩn.
zh_hans: output_path 不能指向隐藏文件。
zh_hant: output_path 不能指向隱藏檔案。

source: Query Result Row Cap
fr: Limite de la ligne des résultats de la requête
ko: 쿼리 결과 행 상한
tr: Sorgu Sonucu Satır Sınırı
vi: Giới hạn số hàng kết quả
zh_hans: 查询结果行数上限
zh_hant: 查詢結果列數上限

source: Table creation options not available
fr: Les options de création de table ne sont pas disponibles.
ko: 테이블 생성 옵션을 사용할 수 없습니다
vi: Tùy chọn tạo bảng không khả dụng
zh_hans: 表创建选项不可用
zh_hant: 無法使用資料表建立選項

source: Yesterday
fr: Hier
ko: 어제
tr: Dün
vi: Hôm qua
zh_hans: 昨天
zh_hant: 昨天

source: Execute a query to map its loaded rows.
fr: Exécutez une requête pour cartographier ses lignes chargées.

source: %@ cannot take rows from this file, so no table was created.
fr: %@ ne peut pas prendre de lignes de ce fichier, donc aucune table n'a été créée.

source: Install Plugin…
fr: Installer le plugin...
ko: 플러그인 설치…
tr: Eklenti Yükle…
vi: Cài plugin…
zh_hans: 安装插件…
zh_hant: 安裝外掛…

source: Optimize Query
fr: Optimiser la requête
ko: 쿼리 최적화
vi: Tối ưu truy vấn
zh_hans: 优化查询
zh_hant: 最佳化查詢

source: an explain
fr: Une explication
ko: 실행 계획 조회
tr: bir açıklama
vi: một lệnh explain
zh_hans: 一次 explain
zh_hant: 一次 explain

source: Prompt for password
fr: Demande de mot de passe
ko: 암호 입력 요청
tr: Parolayı sor
vi: Hỏi mật khẩu
zh_hans: 提示输入密码
zh_hant: 提示輸入密碼

source: %@ is required
fr: %@ est requis
ko: %@ 항목이 필요합니다
tr: %@ gerekli
vi: %@ là bắt buộc
zh_hans: %@为必填项
zh_hant: %@ 為必填

source: New View
fr: Nouvelle vue
ko: 새 뷰
tr: Yeni Görünüm
vi: View mới
zh_hans: 新建视图
zh_hant: 新增檢視表

source: Connection Access
fr: Accès à la connexion
ko: 연결 접근 권한
tr: Bağlantı Erişimi
vi: Quyền truy cập kết nối
zh_hans: 连接访问权限
zh_hant: 連線存取權限

source: List the triggers attached to one table, with their timing, event, and body.
fr: Listez les déclencheurs attachés à une table, avec leur temps, leur événement et leur corps.
ko: 한 테이블에 연결된 트리거를 타이밍, 이벤트, 본문과 함께 나열합니다.
tr: Bir tabloya bağlı tetikleyicileri zamanlaması, olayı ve gövdesiyle birlikte listeler.
vi: Liệt kê các trigger gắn với một bảng, kèm thời điểm kích hoạt, sự kiện và thân trigger.
zh_hans: 列出附加在一张表上的触发器，包括其触发时机、事件和主体。
zh_hant: 列出附加在一張資料表上的觸發器，包括其觸發時機、事件和主體。

source: Server port
fr: Port du serveur
ko: 서버 포트
tr: Sunucu bağlantı noktası
vi: Cổng máy chủ
zh_hans: 服务器端口
zh_hant: 伺服器連接埠

source: %lld ^[row](inflect: true) to export
fr: %lld ^[row](inflect: true) pour exporter

source: Show Table Structure
fr: Afficher la structure de la table
ko: 테이블 구조 보기
tr: Tablo Yapısını Göster
vi: Hiện cấu trúc bảng
zh_hans: 显示表结构
zh_hant: 顯示資料表結構

source: No procedures
fr: Pas de procédures
ko: 프로시저 없음
tr: Yordam yok
vi: Không có procedure
zh_hans: 没有存储过程
zh_hant: 沒有預存程序

source: Search Schema
fr: Schéma de recherche
ko: 스키마 검색
tr: Şemada Ara
vi: Tìm trong schema
zh_hans: 搜索 Schema
zh_hant: 搜尋綱要

source: Theme
fr: Thème
ko: 테마
tr: Tema
vi: Giao diện
zh_hans: 主题
zh_hant: 佈景主題

source: Also handles:
fr: Gère également :
ko: 다음 항목도 처리:
tr: Ayrıca işler:
vi: Cũng hỗ trợ:
zh_hans: 还支持：
zh_hant: 同時支援：

source: Space
fr: Espace
ko: 공백
tr: Boşluk
vi: Khoảng trắng
zh_hans: 空格
zh_hant: 空格

source: Couldn't check whether this view can be refreshed concurrently.
fr: Impossible de vérifier si cette vue peut être rafraîchie simultanément.

source: The engine returned no result set to export.
fr: Le moteur n'a pas renvoyé de jeu de résultats à exporter.
ko: 엔진이 내보낼 결과 집합을 반환하지 않았습니다.
tr: Motor dışa aktarılacak bir sonuç kümesi döndürmedi.
vi: Engine không trả về tập kết quả nào để xuất.
zh_hans: 引擎没有返回可导出的结果集。
zh_hant: 引擎沒有回傳可匯出的結果集。

source: Rename %@
fr: Renommer %@
ko: %@ 이름 변경
tr: %@ adını değiştir
vi: Đổi tên %@
zh_hans: 重命名 %@
zh_hant: 重新命名 %@

source: Syncs connections, settings, and SSH profiles across your Macs via iCloud.
fr: Synchronise les connexions, les paramètres et les profils SSH sur tous vos Macs via iCloud.
ko: iCloud를 통해 Mac 간에 연결, 설정 및 SSH 프로필을 동기화합니다.
tr: Bağlantıları, ayarları ve SSH profillerini iCloud üzerinden Mac'leriniz arasında senkronize eder.
vi: Đồng bộ kết nối, cài đặt và cấu hình SSH giữa các máy Mac qua iCloud.
zh_hans: 通过 iCloud 在多台 Mac 之间同步连接、设置和 SSH 配置。
zh_hant: 透過 iCloud 在你的多台 Mac 之間同步連線、設定與 SSH 設定檔。

source: No Triggers
fr: Pas de déclencheurs
ko: 트리거 없음
tr: Tetikleyici Yok
vi: Không có trigger
zh_hans: 无触发器
zh_hant: 無觸發器

source: Clear applied filters without removing filter rows
fr: Effacer les filtres appliqués sans supprimer les lignes de filtres.
ko: 필터 행은 유지하고 적용된 필터만 지우기
tr: Filtre satırlarını kaldırmadan uygulanan filtreleri temizle
vi: Xóa các bộ lọc đã áp dụng mà không gỡ các dòng bộ lọc
zh_hans: 清除已应用的筛选，但不移除筛选行
zh_hant: 清除已套用的篩選，但不移除篩選列

source: This profile will be permanently deleted.
fr: Ce profil sera supprimé définitivement.
ko: 이 프로필은 영구적으로 삭제됩니다.
tr: Bu profil kalıcı olarak silinecek.
vi: Hồ sơ này sẽ bị xoá vĩnh viễn.
zh_hans: 此配置将被永久删除。
zh_hant: 此設定檔將被永久刪除。

source: Layout
fr: Mise en page
ko: 레이아웃
tr: Düzen
vi: Bố cục
zh_hans: 布局
zh_hant: 版面配置

source: Copy Key Path
fr: Copier le chemin de la clé
ko: 키 경로 복사
tr: Anahtar Yolunu Kopyala
vi: Sao chép đường dẫn khoá
zh_hans: 复制键路径
zh_hant: 複製鍵路徑

source: The Cloudflare tunnel did not become ready in time.
fr: Le tunnel Cloudflare n'est pas devenu prêt à temps.
ko: Cloudflare 터널이 제한 시간 내에 준비되지 않았습니다.
tr: Cloudflare tüneli zamanında hazır olmadı.
vi: Tunnel Cloudflare không sẵn sàng kịp thời.
zh_hans: Cloudflare 隧道未能及时就绪。
zh_hant: Cloudflare 隧道未能及時就緒。

source: Delete Folder?
fr: Supprimer le dossier ?
ko: 폴더를 삭제하시겠습니까?
tr: Klasör Silinsin mi?
vi: Xoá thư mục?
zh_hans: 删除文件夹？
zh_hant: 刪除資料夾？

source: Some included tables have not been compared with their current settings.
fr: Certaines tables incluses n'ont pas été comparées à leurs paramètres actuels.

source: Drawing %d shapes.
fr: Dessiner %d formes.

source: Ollama is running but has no models. Run "ollama pull <model>" to download one.
fr: Ollama fonctionne mais n'a pas de modèles. Exécutez "ollama pull <model>" pour en télécharger un.
ko: Ollama가 실행 중이지만 모델이 없습니다. 모델을 다운로드하려면 "ollama pull <model>"을 실행하십시오.
tr: Ollama çalışıyor ancak modeli yok. Bir model indirmek için "ollama pull <model>" komutunu çalıştırın.
vi: Ollama đang chạy nhưng không có mô hình nào. Chạy "ollama pull <model>" để tải về.
zh_hans: Ollama 正在运行但没有模型。运行 "ollama pull <model>" 下载一个。
zh_hant: Ollama 正在執行但沒有模型。請執行 "ollama pull <model>" 下載一個。

source: Sign in to iCloud to enable sync
fr: Connectez-vous à iCloud pour activer la synchronisation.
ko: 동기화를 활성화하려면 iCloud에 로그인하십시오
tr: Eşitlemeyi açmak için iCloud'a giriş yapın
vi: Đăng nhập iCloud để bật đồng bộ
zh_hans: 登录 iCloud 以启用同步
zh_hant: 登入 iCloud 以啟用同步

source: Array element scope
fr: Portée de l'élément de tableau
ko: 배열 요소 범위
tr: Dizi öğesi kapsamı
vi: Phạm vi phần tử mảng
zh_hans: 数组元素作用域
zh_hant: 陣列元素範圍

source: Preview Referenced Row
fr: Aperçu de la ligne référencée
ko: 참조 대상 행 미리보기
tr: Referans Satırı Önizle
vi: Xem trước dòng tham chiếu
zh_hans: 预览引用行
zh_hant: 預覽參照列

source: %1$@ was signed by %2$@ (Team ID %3$@) and notarized by Apple. TablePro did not write it. A database plugin runs as part of TablePro and can read the credentials of every connection you open. Trust this developer only if you would give them that access. Trusting applies to every plugin this developer signs, now and later. You can withdraw it in Settings > Plugins.
fr: %1$@ a été signé par %2$@ (ID d'équipe %3$@) et notarié par Apple. TablePro ne l'a pas écrit. Un plugin de base de données fonctionne en tant que partie de TablePro et peut lire les informations d'identification de chaque connexion que vous ouvrez. Faites confiance à ce développeur uniquement si vous lui donnez cet accès. La confiance s'applique à chaque plugin que ce développeur signe, maintenant et plus tard. Vous pouvez le retirer dans Paramètres > Plugins.
ko: 플러그인: %1$@. 서명자: %2$@ (팀 ID %3$@). Apple의 공증을 받았습니다. TablePro에서 만든 플러그인이 아닙니다. 데이터베이스 플러그인은 TablePro의 일부로 실행되며 사용자가 여는 모든 연결의 자격 증명을 읽을 수 있습니다. 해당 접근 권한을 부여해도 되는 개발자만 신뢰하십시오. 개발자를 신뢰하면 현재와 이후에 이 개발자가 서명하는 모든 플러그인에 적용됩니다. 설정 > 플러그인에서 언제든지 신뢰를 해제할 수 있습니다.
tr: %1$@, %2$@ tarafından imzalandı (Takım Kimliği %3$@) ve Apple tarafından onaylandı. TablePro bunu yazmadı. Bir veritabanı eklentisi TablePro'nun parçası olarak çalışır ve açtığınız her bağlantının kimlik bilgilerini okuyabilir. Bu geliştiriciye yalnızca ona bu erişimi vermeye razıysanız güvenin. Güven, bu geliştiricinin şimdi ve sonra imzaladığı her eklenti için geçerlidir. Ayarlar > Eklentiler bölümünden geri alabilirsiniz.
vi: %1$@ được ký bởi %2$@ (Team ID %3$@) và đã được Apple công chứng. TablePro không viết nó. Một plugin cơ sở dữ liệu chạy như một phần của TablePro và có thể đọc thông tin đăng nhập của mọi kết nối bạn mở. Chỉ tin cậy nhà phát triển này nếu bạn sẵn sàng cấp quyền truy cập đó. Việc tin cậy áp dụng cho mọi plugin mà nhà phát triển này ký, bây giờ và về sau. Bạn có thể thu hồi trong Cài đặt > Plugin.
zh_hans: %1$@ 由 %2$@（团队 ID %3$@）签名并经 Apple 公证。它不是 TablePro 编写的。 数据库插件作为 TablePro 的一部分运行，可以读取你打开的每个连接的凭据。只有在你愿意授予该访问权限时才信任此开发者。 信任适用于该开发者现在和以后签名的每个插件。你可以在“设置 > 插件”中撤销。
zh_hant: %1$@ 由 %2$@（團隊 ID %3$@）簽署並經 Apple 公證。它不是 TablePro 編寫的。 資料庫外掛作為 TablePro 的一部分執行，可以讀取你開啟的每個連線的認證資訊。只有在你願意授予該存取權時才信任此開發者。 信任適用於該開發者現在與日後簽署的每個外掛。你可以在「設定 > 外掛」中撤銷。

source: New Session
fr: Nouvelle session

source: An SSM target is required, such as i-0123456789abcdef0
fr: Un objectif SSM est requis, tel que i-0123456789abcdef0.

source: Operation not permitted
fr: Opération non autorisée
ko: 작업이 허용되지 않음
tr: İşleme izin verilmiyor
vi: Thao tác không được phép
zh_hans: 操作不被允许
zh_hant: 操作不被允許

source: MFA Passcode (TOTP)
fr: Mot de passe MFA (TOTP)
ko: MFA 인증 코드(TOTP)
tr: MFA Parola Kodu (TOTP)
vi: Mã MFA (TOTP)
zh_hans: MFA 验证码（TOTP）
zh_hant: MFA 驗證碼（TOTP）

source: Brief summary of the issue
fr: Brève synthèse du problème
ko: 문제에 대한 간략한 요약
tr: Sorunun kısa özeti
vi: Tóm tắt ngắn gọn về vấn đề
zh_hans: 问题的简要描述
zh_hant: 問題的簡要說明

source: %@ more, in the script beside this
fr: %@ plus, dans le script à côté de celui-ci.

source: License signature verification failed.
fr: Vérification de la signature de la licence échouée.
ko: 라이선스 서명 확인에 실패했습니다.
tr: Lisans imza doğrulaması başarısız oldu.
vi: Xác minh chữ ký giấy phép thất bại.
zh_hans: 许可证签名验证失败。
zh_hant: 授權簽章驗證失敗。

source: Sign In
fr: Se connecter
ko: 로그인
tr: Giriş Yap
vi: Đăng nhập
zh_hans: 登录
zh_hant: 登入

source: %@ rows
fr: %@ lignes
ko: %@행
tr: %@ satır
vi: %@ dòng
zh_hans: %@ 行
zh_hant: %@ 列

source: This plan could not be read as a tree, so the two runs are compared as text.
fr: Ce plan ne pouvait pas être lu comme un arbre, donc les deux courses sont comparées en tant que texte.
ko: 이 플랜을 트리로 읽을 수 없어 두 실행을 텍스트로 비교합니다.
tr: Bu plan bir ağaç olarak okunamadı, bu yüzden iki çalıştırma metin olarak karşılaştırılıyor.
vi: Không thể đọc kế hoạch này dưới dạng cây, nên hai lần chạy được so sánh dưới dạng văn bản.
zh_hans: 无法将此计划读取为树，因此两次运行按文本比较。
zh_hant: 無法將此計劃讀取為樹，因此兩次執行按文字比較。

source: Full CREATE TRIGGER statement
fr: Déclaration complète CREATE TRIGGER
ko: 전체 CREATE TRIGGER 명령문
tr: Tam CREATE TRIGGER ifadesi
vi: Câu lệnh CREATE TRIGGER đầy đủ
zh_hans: 完整的 CREATE TRIGGER 语句
zh_hant: 完整的 CREATE TRIGGER 陳述式

source: The run was rolled back, but %1$@ cannot roll back, so rows already written there stay in %2$@. Compare again to see where it stands.
fr: La mise à jour a été annulée, mais %1$@ ne peut pas être annulée, donc les lignes déjà écrites y restent dans %2$@. Comparez à nouveau pour voir où elle se trouve.

source: Replication lag: %ds
fr: Retard de réplication : %ds
ko: 복제 지연: %d초
tr: Çoğaltma gecikmesi: %ds
vi: Độ trễ sao chép: %ds
zh_hans: 复制延迟：%d秒
zh_hant: 複寫延遲：%d 秒

source: %d left out
fr: %d omis
ko: %d개 제외됨
tr: %d hariç
vi: %d bị bỏ ra
zh_hans: 已排除 %d 项
zh_hant: 已排除 %d 項

source: The Microsoft Entra ID access token was rejected by the driver.
fr: Le jeton d'accès Microsoft Entra ID a été rejeté par le pilote.
ko: Microsoft Entra ID 액세스 토큰이 드라이버에서 거부되었습니다.
tr: Microsoft Entra ID erişim belirteci sürücü tarafından reddedildi.
vi: Access token Microsoft Entra ID bị driver từ chối.
zh_hans: 驱动拒绝了该 Microsoft Entra ID 访问令牌。
zh_hant: 驅動程式拒絕了該 Microsoft Entra ID 存取權杖。

source: The Oracle listener refused the connection (ORA-%ld).
fr: L'écouteur Oracle a refusé la connexion (ORA-%ld).
ko: Oracle 리스너가 연결을 거부했습니다(ORA-%ld).
tr: Oracle dinleyicisi bağlantıyı reddetti (ORA-%ld).
vi: Oracle listener đã từ chối kết nối (ORA-%ld).
zh_hans: Oracle 侦听器拒绝了此连接（ORA-%ld）。
zh_hant: Oracle 接聽程式拒絕了此連線（ORA-%ld）。

source: Syntax Colors
fr: Couleurs de syntaxe
ko: 구문 색상
tr: Sözdizimi Renkleri
vi: Màu cú pháp
zh_hans: 语法颜色
zh_hant: 語法顏色

# %lld tables, %lld relationships
source: %1$lld tables, %2$lld relationships
fr: %1$lld tables, %2$lld relations
ko: %1$lld개 테이블, %2$lld개 관계
tr: %lld tablo, %lld ilişki
vi: %lld bảng, %lld quan hệ
zh_hans: %lld 个表，%lld 个关系
zh_hant: %1$lld 個資料表，%2$lld 個關聯

source: This %1$@ has no %2$@ yet.
fr: Ce %1$@ n'a pas encore de %2$@.
ko: 이 %1$@에는 아직 %2$@이(가) 없습니다.
tr: Bu %1$@ henüz %2$@ içermiyor.
vi: %1$@ này chưa có %2$@.
zh_hans: 此%1$@还没有%2$@。
zh_hant: 此%1$@還沒有%2$@。

source: Encrypted Export
fr: Exportation cryptée
ko: 암호화된 내보내기
tr: Şifreli Dışa Aktarma
vi: Xuất Mã hóa
zh_hans: 加密导出
zh_hant: 加密匯出

source: This profile is not allowed to run rds:DescribeDBInstances in %@. Attach AmazonRDSReadOnlyAccess or an equivalent policy.
fr: Ce profil n'est pas autorisé à exécuter rds:DescribeDBInstances dans %@. Attachez AmazonRDSReadOnlyAccess ou une politique équivalente.

source: SqlPackage has no other way to receive one, so while it runs the password is readable by other processes on this Mac. Windows or Entra authentication avoids it.
fr: SqlPackage n'a pas d'autre moyen de recevoir un tel fichier, donc pendant qu'il fonctionne, le mot de passe est lisible par d'autres processus sur ce Mac. L'authentification Windows ou Entra l'évitent.

source: Sync connections, settings, and favorites across your Macs.
fr: Synchronisez les connexions, les paramètres et les favoris sur tous vos Macs.
ko: Mac 간에 연결, 설정 및 즐겨찾기를 동기화합니다.
tr: Bağlantıları, ayarları ve sık kullanılanları Mac'leriniz arasında eşitleyin.
vi: Đồng bộ kết nối, cài đặt và mục yêu thích giữa các máy Mac của bạn.
zh_hans: 在你的多台 Mac 之间同步连接、设置和收藏。
zh_hant: 在你的多台 Mac 之間同步連線、設定和我的最愛。

source: A query is already running.
fr: Une requête est déjà en cours.

source: creating a database
fr: Créer une base de données
ko: 데이터베이스 생성
tr: bir veritabanı oluşturma
vi: tạo một cơ sở dữ liệu
zh_hans: 创建一个数据库
zh_hant: 建立一個資料庫

source: Runs against this connection's current database.
fr: Exécute sur la base de données actuelle de cette connexion.

source: %lld mapped
fr: %lld mappé

source: TablePro runs a small query on each open connection so it can notice a dropped one and reconnect before you hit it. Only when I use the connection stops that background traffic, which is what a database that sleeps when idle, or bills per query, needs; TablePro then checks the connection the first time you use it after a pause.
fr: TablePro effectue une petite requête sur chaque connexion ouverte afin de pouvoir détecter une connexion perdue et se reconnecter avant que vous ne la frappiez. Ce n'est qu'en utilisant la connexion que le trafic en arrière-plan s'arrête, ce dont a besoin une base de données qui dort lorsqu'elle est inutilisée ou facture par requête ; TablePro vérifie ensuite la connexion la première fois que vous l'utilisez après une pause.

source: The saved list could not be read. Adding an extension replaces it.
fr: La liste enregistrée n'a pas pu être lu. L'ajout d'une extension la remplace.

source: Inspector View
fr: Vue de l'inspecteur

source: Load the rows the row cap left behind.
fr: Chargez les lignes la limite de ligne laissée derrière.
ko: 행 제한으로 남겨진 행을 불러옵니다.
tr: Satır sınırının dışında kalan satırları yükleyin.
vi: Tải những hàng còn lại sau giới hạn hàng.
zh_hans: 加载行数上限之外剩余的行。
zh_hant: 載入列數上限之外剩餘的列。

source: No Plan Available
fr: Aucun plan disponible
ko: 사용 가능한 쿼리 계획 없음
tr: Plan Yok
vi: Không có kế hoạch
zh_hans: 没有可用的执行计划
zh_hant: 沒有可用的執行計畫

source: Indexes on the table
fr: Index sur la table
ko: 테이블의 인덱스
tr: Tablodaki indeksler
vi: Các chỉ mục trên bảng
zh_hans: 该表上的索引
zh_hant: 該資料表上的索引

source: “%1$@” could not be written. %2$@
fr: « %1$@ » n’a pas pu être écrit. %2$@
ko: “%1$@”을(를) 쓸 수 없습니다. %2$@
tr: “%1$@” yazılamadı. %2$@
vi: Không thể ghi “%1$@”. %2$@
zh_hans: 无法写入“%1$@”。%2$@
zh_hant: 無法寫入「%1$@」。%2$@

source: Schema names, sorted
fr: Noms de schémas, triés
ko: 정렬된 스키마 이름
tr: Şema adları, sıralı
vi: Tên schema, đã sắp xếp
zh_hans: 已排序的 Schema 名称
zh_hant: 已排序的綱要名稱

source: Comparing only. Nothing has been written.
fr: Comparaison uniquement. Rien n'a été écrit.
ko: 비교만 했습니다. 아무것도 기록되지 않았습니다.
tr: Yalnızca karşılaştırılıyor. Hiçbir şey yazılmadı.
vi: Chỉ so sánh. Chưa ghi gì cả.
zh_hans: 仅比较。尚未写入任何内容。
zh_hant: 僅比較。尚未寫入任何內容。

source: First page
fr: Première page
ko: 첫 페이지
tr: İlk sayfa
vi: Trang đầu
zh_hans: 第一页
zh_hant: 第一頁

source: Sync zone not found. A full sync will be performed.
fr: Zone de synchronisation non trouvée. Une synchronisation complète sera effectuée.
ko: 동기화 영역을 찾을 수 없습니다. 전체 동기화를 수행합니다.
tr: Eşitleme bölgesi bulunamadı. Tam eşitleme yapılacak.
vi: Không tìm thấy vùng đồng bộ. Sẽ thực hiện đồng bộ toàn bộ.
zh_hans: 未找到同步区域。将执行完整同步。
zh_hant: 找不到同步區域。將執行完整同步。

source: The server rejected TablePro's credential.
fr: Le serveur a rejeté les informations d'identification de TablePro.

source: Rename Column…
fr: Renommer la colonne...
ko: 열 이름 변경…
tr: Sütunu Yeniden Adlandır…
vi: Đổi tên cột…
zh_hans: 重命名列…
zh_hant: 重新命名欄位…

source: iCloud storage is full. Free up space or reduce the history sync limit.
fr: Le stockage iCloud est plein. Libérez de l'espace ou réduisez la limite de synchronisation de l'historique.
ko: iCloud 저장 공간이 가득 찼습니다. 공간을 확보하거나 기록 동기화 제한을 줄이십시오.
vi: Bộ nhớ iCloud đã đầy. Giải phóng dung lượng hoặc giảm giới hạn đồng bộ lịch sử.
zh_hans: iCloud 储存空间已满。请释放空间或减少历史记录同步上限。
zh_hant: iCloud 儲存空間已滿。請釋出空間或降低歷程記錄同步上限。

source: Status: warning
fr: Statut : avertissement
ko: 상태: 경고
tr: Durum: uyarı
vi: Trạng thái: cảnh báo
zh_hans: 状态：警告
zh_hant: 狀態：警告

source: Apply 1 statement to %@?
fr: Appliquer 1 déclaration à %@?
ko: 구문 1개를 %@에 적용하시겠습니까?
tr: 1 ifade %@ üzerine uygulansın mı?
vi: Áp dụng 1 câu lệnh vào %@?
zh_hans: 将 1 条语句应用到 %@？
zh_hant: 要將 1 條陳述式套用到 %@ 嗎？

source: The license has been suspended.
fr: La licence a été suspendue.
ko: 라이선스가 정지되었습니다.
tr: Lisans askıya alındı.
vi: Giấy phép đã bị đình chỉ.
zh_hans: 许可证已被暂停。
zh_hant: 授權已遭停用。

source: No SSH servers yet.
fr: Pas encore de serveurs SSH.

source: Move Column Up
fr: Déplacer la colonne vers le haut

source: Current value
fr: Valeur actuelle
ko: 현재 값
tr: Geçerli değer
vi: Giá trị hiện tại
zh_hans: 当前值
zh_hant: 目前值

source: Profile Settings
fr: Paramètres du profil
ko: 프로필 설정
tr: Profil Ayarları
vi: Cài đặt hồ sơ
zh_hans: 配置设置
zh_hant: 設定檔設定

source: Run ssh-add to load one, or point Agent Socket at another agent.
fr: Exécutez ssh-add pour en charger un, ou pointez le socket de l'agent vers un autre agent.

source: Open Schema
fr: Schéma ouvert
ko: 스키마 열기
vi: Mở Schema
zh_hans: 打开 Schema
zh_hant: 開啟綱要

source: "%@" will be removed from your system. This action cannot be undone.
fr: «%@» sera supprimé de votre système. Cette action est irréversible.
ko: "%@" 항목이 시스템에서 제거됩니다. 이 작업은 취소할 수 없습니다.
tr: "%@" sisteminizden kaldırılacak. Bu işlem geri alınamaz.
vi: "%@" sẽ bị xoá khỏi hệ thống. Hành động này không thể hoàn tác.
zh_hans: "%@" 将从您的系统中移除。此操作无法撤销。
zh_hant: 「%@」將從你的系統中移除。此動作無法復原。

source: The batch before it stays applied.
fr: Le lot précédent reste appliqué.
